
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитРеквизитыПоПараметрам();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	ЗаписатьКлючевоеСловоОбъекта();
	Закрыть();
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура УстановитРеквизитыПоПараметрам()
	
	Для Каждого ЭлементФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Параметры.Свойство(ЭлементФормы.Имя) Тогда
			ЭтаФорма[ЭлементФормы.Имя] = Параметры[ЭлементФормы.Имя];
		КонецЕсли;	
	КонецЦикла;	 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)	
	Закрыть();	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьКлючевоеСловоОбъекта()
	Если ЗначениеЗаполнено(ВидОперации) И ЗначениеЗаполнено(КлючевоеСлово) Тогда
		РегистрыСведений.КБ_КлючевыеСловаОбъектов.ЗаписатьКлючевоеСловоОбъекта(КлючевоеСлово, ВидОперации);		
	КонецЕсли;
КонецПроцедуры



#КонецОбласти